#ifndef HIDL_GENERATED_VENDOR_QTI_HARDWARE_BLUETOOTH_AUDIO_V2_0_TYPES_H
#define HIDL_GENERATED_VENDOR_QTI_HARDWARE_BLUETOOTH_AUDIO_V2_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

#ifdef _MSC_VER
#ifndef __attribute__
#define __attribute__(...)
#endif
#endif

namespace vendor {
namespace qti {
namespace hardware {
namespace bluetooth_audio {
namespace V2_0 {

// Forward declaration for forward reference support:
struct TimeSpec;
enum class Status : uint8_t;
enum class SessionType : uint8_t;
enum class CodecType : uint32_t;
enum class SampleRate : uint32_t;
enum class BitsPerSample : uint8_t;
enum class ChannelMode : uint8_t;
enum class SbcChannelMode : uint8_t;
enum class SbcBlockLength : uint8_t;
enum class SbcNumSubbands : uint8_t;
enum class SbcAllocMethod : uint8_t;
enum class AacObjectType : uint8_t;
enum class AacVariableBitRate : uint8_t;
enum class AptxAdaptiveChannelMode : int32_t;
enum class AptxMode : uint32_t;
enum class InputMode : uint32_t;
struct AptxSinkBuffering;
struct AptxAdaptive_TTP;
enum class LdacChannelMode : uint8_t;
enum class LdacQualityIndex : uint8_t;
enum class SessionParamType : uint8_t;
struct PcmParameters;
struct SbcParameters;
struct AacParameters;
struct LdacParameters;
struct AptxParameters;
struct AptxAdaptiveParameters;
struct AptxTwsParameters;
struct BaCeltParameters;
struct CodecCapabilities;
struct SinkLatency;
struct SessionParams;
union AudioCapabilities;
struct CodecConfiguration;
union AudioConfiguration;

/**
 * The different audio parameter structs are used to provide a method to list
 * all the Capabilities of a codec as well as to configure the codecs. All
 * fields are bitfields unless specified. If used as a configuration, only one
 * bit may be enabled. If used for Capabilities, enable all bits corresponding to
 * supported features.
 *
 *
 * POSIX timespec.
 */
struct TimeSpec final {
    uint64_t tvSec __attribute__ ((aligned(8)));
    uint64_t tvNSec __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::TimeSpec, tvSec) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::TimeSpec, tvNSec) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::TimeSpec) == 16, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::TimeSpec) == 8, "wrong alignment");

enum class Status : uint8_t {
    SUCCESS = 0 /* 0x00 */,
    /**
     * Codec configuration not supported by the audio platform
     */
    UNSUPPORTED_CODEC_CONFIGURATION = 1 /* ::vendor::qti::hardware::bluetooth_audio::V2_0::Status.SUCCESS implicitly + 1 */,
    /**
     * Any other failure
     */
    FAILURE = 2 /* ::vendor::qti::hardware::bluetooth_audio::V2_0::Status.UNSUPPORTED_CODEC_CONFIGURATION implicitly + 1 */,
    /*
     * Pending response from Sink
     */
    SINK_NOT_READY = 3 /* ::vendor::qti::hardware::bluetooth_audio::V2_0::Status.FAILURE implicitly + 1 */,
    /*
     * Telephony Call in progress
     */
    CALL_IN_PROGRESS = 4 /* ::vendor::qti::hardware::bluetooth_audio::V2_0::Status.SINK_NOT_READY implicitly + 1 */,
    /*
     * Short wait error
     */
    SW_ERROR = 5 /* ::vendor::qti::hardware::bluetooth_audio::V2_0::Status.CALL_IN_PROGRESS implicitly + 1 */,
    /*
     * Long wait error
     */
    LW_ERROR = 6 /* ::vendor::qti::hardware::bluetooth_audio::V2_0::Status.SW_ERROR implicitly + 1 */,
    /*
     * disconnection in progress
     */
    FAILURE_DISC_IN_PROGRESS = 7 /* ::vendor::qti::hardware::bluetooth_audio::V2_0::Status.LW_ERROR implicitly + 1 */,
    /*
     * No wait failure
     */
    FAILURE_NO_WAIT = 8 /* ::vendor::qti::hardware::bluetooth_audio::V2_0::Status.FAILURE_DISC_IN_PROGRESS implicitly + 1 */,
};

enum class SessionType : uint8_t {
    UNKNOWN = 0,
    /**
     * A2DP legacy that AVDTP media is encoded by Bluetooth Stack
     */
    A2DP_SOFTWARE_ENCODING_DATAPATH = 1 /* ::vendor::qti::hardware::bluetooth_audio::V2_0::SessionType.UNKNOWN implicitly + 1 */,
    /**
     * The encoding of AVDTP media is done by HW and there is control only
     */
    A2DP_HARDWARE_OFFLOAD_DATAPATH = 2 /* ::vendor::qti::hardware::bluetooth_audio::V2_0::SessionType.A2DP_SOFTWARE_ENCODING_DATAPATH implicitly + 1 */,
    /**
     * Used when encoded by Bluetooth Stack and streaming to Hearing Aid
     */
    HEARING_AID_SOFTWARE_ENCODING_DATAPATH = 3 /* ::vendor::qti::hardware::bluetooth_audio::V2_0::SessionType.A2DP_HARDWARE_OFFLOAD_DATAPATH implicitly + 1 */,
};

enum class CodecType : uint32_t {
    UNKNOWN = 0u /* 0x00 */,
    SBC = 1u /* 0x01 */,
    AAC = 2u /* 0x02 */,
    APTX = 4u /* 0x04 */,
    APTX_HD = 8u /* 0x08 */,
    LDAC = 16u /* 0x10 */,
    BA_CELT = 17u /* 0x11 */,
    APTX_ADAPTIVE = 18u /* 0x12 */,
    APTX_TWS = 20u /* 0x14 */,
};

enum class SampleRate : uint32_t {
    RATE_UNKNOWN = 0u /* 0x00 */,
    RATE_44100 = 1u /* 0x01 */,
    RATE_48000 = 2u /* 0x02 */,
    RATE_88200 = 4u /* 0x04 */,
    RATE_96000 = 8u /* 0x08 */,
    RATE_176400 = 16u /* 0x10 */,
    RATE_192000 = 32u /* 0x20 */,
    RATE_16000 = 64u /* 0x40 */,
    RATE_24000 = 96u /* 0x60 */,
    RATE_32000 = 128u /* 0x80 */,
};

enum class BitsPerSample : uint8_t {
    BITS_UNKNOWN = 0 /* 0x00 */,
    BITS_16 = 1 /* 0x01 */,
    BITS_24 = 2 /* 0x02 */,
    BITS_32 = 4 /* 0x04 */,
};

enum class ChannelMode : uint8_t {
    UNKNOWN = 0 /* 0x00 */,
    MONO = 1 /* 0x01 */,
    STEREO = 2 /* 0x02 */,
};

enum class SbcChannelMode : uint8_t {
    /**
     * Channel Mode: 4 bits
     */
    UNKNOWN = 0 /* 0x00 */,
    JOINT_STEREO = 1 /* 0x01 */,
    STEREO = 2 /* 0x02 */,
    DUAL = 4 /* 0x04 */,
    MONO = 8 /* 0x08 */,
};

enum class SbcBlockLength : uint8_t {
    BLOCKS_4 = 128 /* 0x80 */,
    BLOCKS_8 = 64 /* 0x40 */,
    BLOCKS_12 = 32 /* 0x20 */,
    BLOCKS_16 = 16 /* 0x10 */,
};

enum class SbcNumSubbands : uint8_t {
    SUBBAND_4 = 8 /* 0x08 */,
    SUBBAND_8 = 4 /* 0x04 */,
};

enum class SbcAllocMethod : uint8_t {
    /**
     * SNR
     */
    ALLOC_MD_S = 2 /* 0x02 */,
    /**
     * Loudness
     */
    ALLOC_MD_L = 1 /* 0x01 */,
};

enum class AacObjectType : uint8_t {
    /**
     * MPEG-2 Low Complexity. Support is Mandatory.
     */
    MPEG2_LC = 128 /* 0x80 */,
    /**
     * MPEG-4 Low Complexity. Support is Optional.
     */
    MPEG4_LC = 64 /* 0x40 */,
    /**
     * MPEG-4 Long Term Prediction. Support is Optional.
     */
    MPEG4_LTP = 32 /* 0x20 */,
    /**
     * MPEG-4 Scalable. Support is Optional.
     */
    MPEG4_SCALABLE = 16 /* 0x10 */,
};

enum class AacVariableBitRate : uint8_t {
    ENABLED = 128 /* 0x80 */,
    DISABLED = 0 /* 0x00 */,
};

enum class AptxAdaptiveChannelMode : int32_t {
    /**
     * Channel Mode: 5 bits
     */
    UNCHANGED = -1 /* -1 */,
    JOINT_STEREO = 0,
    MONO = 1,
    DUAL_MONO = 2,
    TWS_STEREO = 4,
    EARBUD = 8,
    TWS_MONO = 10,
    UNKNOWN = 255 /* 0xFF */,
};

enum class AptxMode : uint32_t {
    /**
     * Aptx Adaptive Mode: 32 bits
     */
    UNKNOWN = 0u /* 0x00 */,
    HQ = 4096u /* 0x1000 */,
    LL = 8192u /* 0x2000 */,
    ULL = 16384u /* 0x4000 */,
    SCAN_CONTROL = 32768u /* 0x8000 */,
};

enum class InputMode : uint32_t {
    /**
     * Aptx Adaptive Input Mode: 32 bits
     */
    STEREO = 0u /* 0x00 */,
    DUAL_MONO = 1u /* 0x01 */,
};

struct AptxSinkBuffering final {
    uint8_t minSinkBuff_LL __attribute__ ((aligned(1)));
    uint8_t maxSinkBuff_LL __attribute__ ((aligned(1)));
    uint8_t minSinkBuff_HQ __attribute__ ((aligned(1)));
    uint8_t maxSinkBuff_HQ __attribute__ ((aligned(1)));
    uint8_t minSinkBuff_TWS __attribute__ ((aligned(1)));
    uint8_t maxSinkBuff_TWS __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxSinkBuffering, minSinkBuff_LL) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxSinkBuffering, maxSinkBuff_LL) == 1, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxSinkBuffering, minSinkBuff_HQ) == 2, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxSinkBuffering, maxSinkBuff_HQ) == 3, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxSinkBuffering, minSinkBuff_TWS) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxSinkBuffering, maxSinkBuff_TWS) == 5, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxSinkBuffering) == 6, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxSinkBuffering) == 1, "wrong alignment");

struct AptxAdaptive_TTP final {
    uint8_t TTP_LL_low __attribute__ ((aligned(1)));
    uint8_t TTP_LL_high __attribute__ ((aligned(1)));
    uint8_t TTP_HQ_low __attribute__ ((aligned(1)));
    uint8_t TTP_HQ_high __attribute__ ((aligned(1)));
    uint8_t TTP_TWS_low __attribute__ ((aligned(1)));
    uint8_t TTP_TWS_high __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptive_TTP, TTP_LL_low) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptive_TTP, TTP_LL_high) == 1, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptive_TTP, TTP_HQ_low) == 2, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptive_TTP, TTP_HQ_high) == 3, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptive_TTP, TTP_TWS_low) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptive_TTP, TTP_TWS_high) == 5, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptive_TTP) == 6, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptive_TTP) == 1, "wrong alignment");

enum class LdacChannelMode : uint8_t {
    /**
     * Channel Mode: 3 bits
     */
    UNKNOWN = 0 /* 0x00 */,
    STEREO = 1 /* 0x01 */,
    DUAL = 2 /* 0x02 */,
    MONO = 4 /* 0x04 */,
};

enum class LdacQualityIndex : uint8_t {
    QUALITY_HIGH = 0 /* 0x00 */,
    QUALITY_MID = 1 /* 0x01 */,
    QUALITY_LOW = 2 /* 0x02 */,
    QUALITY_ABR = 127 /* 0x7F */,
};

enum class SessionParamType : uint8_t {
    UNKNOWN = 0 /* 0x00 */,
    MTU = 1 /* 0x01 */,
    BITRATE = 2 /* 0x02 */,
    SINK_LATENCY = 3 /* 0x03 */,
};

/**
 * Used for Software Encoding audio feed parameters
 */
struct PcmParameters final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::ChannelMode channelMode __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::PcmParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::PcmParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::PcmParameters, bitsPerSample) == 5, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::PcmParameters) == 8, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::PcmParameters) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding SBC codec parameters.
 * minBitpool and maxBitpool are not bitfields.
 */
struct SbcParameters final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SbcChannelMode channelMode __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SbcBlockLength blockLength __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SbcNumSubbands numSubbands __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SbcAllocMethod allocMethod __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
    uint8_t minBitpool __attribute__ ((aligned(1)));
    uint8_t maxBitpool __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters, blockLength) == 5, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters, numSubbands) == 6, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters, allocMethod) == 7, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters, bitsPerSample) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters, minBitpool) == 9, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters, maxBitpool) == 10, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters) == 12, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding AAC codec parameters
 */
struct AacParameters final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::AacObjectType objectType __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::ChannelMode channelMode __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::AacVariableBitRate variableBitRateEnabled __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
    bool frameControlEnabled __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters, objectType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters, sampleRate) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters, channelMode) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters, variableBitRateEnabled) == 9, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters, bitsPerSample) == 10, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters, frameControlEnabled) == 11, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters) == 12, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding LDAC codec parameters
 * Only used when configuring the codec. When Capabilities are requested, this
 * field is left empty since all qualities must be supported. Not a bitfield.
 */
struct LdacParameters final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::LdacChannelMode channelMode __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::LdacQualityIndex qualityIndex __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::LdacParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::LdacParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::LdacParameters, qualityIndex) == 5, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::LdacParameters, bitsPerSample) == 6, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::LdacParameters) == 8, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::LdacParameters) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding AptX and AptX-HD codec parameters
 */
struct AptxParameters final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::ChannelMode channelMode __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxParameters, bitsPerSample) == 5, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxParameters) == 8, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxParameters) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding AptX-Adaptive codec parameters
 */
struct AptxAdaptiveParameters final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveChannelMode channelMode __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxMode aptxMode __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxSinkBuffering sinkBuffering __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptive_TTP ttp __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::InputMode inputMode __attribute__ ((aligned(4)));
    uint32_t inputFadeDuration __attribute__ ((aligned(4)));
    ::android::hardware::hidl_array<uint8_t, 25> aptxAdaptiveConfigStream __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters, bitsPerSample) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters, aptxMode) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters, sinkBuffering) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters, ttp) == 22, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters, inputMode) == 28, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters, inputFadeDuration) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters, aptxAdaptiveConfigStream) == 36, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters) == 64, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding AptX TWS codec parameters
 */
struct AptxTwsParameters final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::ChannelMode channelMode __attribute__ ((aligned(1)));
    uint8_t syncMode __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxTwsParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxTwsParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxTwsParameters, syncMode) == 5, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxTwsParameters) == 8, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::AptxTwsParameters) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding BA CELT codec parameters
 */
struct BaCeltParameters final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::ChannelMode channelMode __attribute__ ((aligned(1)));
    uint16_t frameSize __attribute__ ((aligned(2)));
    uint16_t complexity __attribute__ ((aligned(2)));
    uint16_t predictionMode __attribute__ ((aligned(2)));
    uint16_t vbrFlag __attribute__ ((aligned(2)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters, frameSize) == 6, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters, complexity) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters, predictionMode) == 10, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters, vbrFlag) == 12, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters) == 16, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters) == 4, "wrong alignment");

/**
 * Used to specify the capabilities of the codecs supported by Hardware Encoding.
 * AptX and AptX-HD both use the AptxParameters field.
 */
struct CodecCapabilities final {
    // Forward declaration for forward reference support:
    union Capabilities;

    union Capabilities final {
        ::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters sbcCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters aacCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::LdacParameters ldacCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxParameters aptxCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters aptxAdaptiveCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxTwsParameters aptxTwsCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters baCeltCapabilities __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities::Capabilities, sbcCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities::Capabilities, aacCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities::Capabilities, ldacCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities::Capabilities, aptxCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities::Capabilities, aptxAdaptiveCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities::Capabilities, aptxTwsCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities::Capabilities, baCeltCapabilities) == 0, "wrong offset");
    static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities::Capabilities) == 64, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities::Capabilities) == 4, "wrong alignment");

    ::vendor::qti::hardware::bluetooth_audio::V2_0::CodecType codecType __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities::Capabilities capabilities __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities, codecType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities, capabilities) == 4, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities) == 68, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities) == 4, "wrong alignment");

struct SinkLatency final {
    uint64_t remoteDeviceAudioDelay __attribute__ ((aligned(8)));
    uint64_t transmittedOctets __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::TimeSpec transmittedOctetsTimeStamp __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SinkLatency, remoteDeviceAudioDelay) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SinkLatency, transmittedOctets) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SinkLatency, transmittedOctetsTimeStamp) == 16, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::SinkLatency) == 32, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::SinkLatency) == 8, "wrong alignment");

/**
 * Used for proactive update of Session Parameters to server
 */
struct SessionParams final {
    // Forward declaration for forward reference support:
    union Param;

    union Param final {
        uint16_t mtu __attribute__ ((aligned(2)));
        uint32_t encodedAudioBitrate __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::SinkLatency sinkLatency __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SessionParams::Param, mtu) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SessionParams::Param, encodedAudioBitrate) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SessionParams::Param, sinkLatency) == 0, "wrong offset");
    static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::SessionParams::Param) == 32, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::SessionParams::Param) == 8, "wrong alignment");

    ::vendor::qti::hardware::bluetooth_audio::V2_0::SessionParamType paramType __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::SessionParams::Param param __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SessionParams, paramType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::SessionParams, param) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::SessionParams) == 40, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::SessionParams) == 8, "wrong alignment");

/**
 * Used to specify the capabilities of the different session types.
 */
union AudioCapabilities final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::PcmParameters pcmCapabilities __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::CodecCapabilities codecCapabilities __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AudioCapabilities, pcmCapabilities) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AudioCapabilities, codecCapabilities) == 0, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::AudioCapabilities) == 68, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::AudioCapabilities) == 4, "wrong alignment");

/**
 * Used to configure a Hardware Encoding session.
 * AptX and AptX-HD both use the AptxParameters field.
 */
struct CodecConfiguration final {
    // Forward declaration for forward reference support:
    union CodecSpecific;

    union CodecSpecific final {
        ::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters sbcConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters aacConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::LdacParameters ldacConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxParameters aptxConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters aptxAdaptiveConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxTwsParameters aptxTwsConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters baCeltConfig __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration::CodecSpecific, sbcConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration::CodecSpecific, aacConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration::CodecSpecific, ldacConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration::CodecSpecific, aptxConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration::CodecSpecific, aptxAdaptiveConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration::CodecSpecific, aptxTwsConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration::CodecSpecific, baCeltConfig) == 0, "wrong offset");
    static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration::CodecSpecific) == 64, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration::CodecSpecific) == 4, "wrong alignment");

    ::vendor::qti::hardware::bluetooth_audio::V2_0::CodecType codecType __attribute__ ((aligned(4)));
    /**
     * The encoded audio bitrate in bits / second.
     * 0x00000000 - The audio bitrate is not specified / unused
     * 0x00000001 - 0x00FFFFFF - Encoded audio bitrate in bits/second
     * 0x01000000 - 0xFFFFFFFF - Reserved
     *
     * The HAL needs to support all legal bitrates for the selected codec.
     */
    uint32_t encodedAudioBitrate __attribute__ ((aligned(4)));
    /**
     * Peer MTU (in octets)
     */
    uint16_t peerMtu __attribute__ ((aligned(2)));
    /**
     * Content protection by SCMS-T
     */
    bool isScmstEnabled __attribute__ ((aligned(1)));
    /**
     * Scrambling Requirement
     */
    bool isScramblingEnabled __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration::CodecSpecific config __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration, codecType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration, encodedAudioBitrate) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration, peerMtu) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration, isScmstEnabled) == 10, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration, isScramblingEnabled) == 11, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration, config) == 12, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration) == 76, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration) == 4, "wrong alignment");

/**
 * Used to configure either a Hardware or Software Encoding session based on session type
 */
union AudioConfiguration final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::PcmParameters pcmConfig __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::CodecConfiguration codecConfig __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AudioConfiguration, pcmConfig) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_0::AudioConfiguration, codecConfig) == 0, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_0::AudioConfiguration) == 76, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_0::AudioConfiguration) == 4, "wrong alignment");

//
// type declarations for package
//

static inline std::string toString(const ::vendor::qti::hardware::bluetooth_audio::V2_0::TimeSpec& o);
static inline void PrintTo(const ::vendor::qti::hardware::bluetooth_audio::V2_0::TimeSpec& o, ::std::ostream*);
static inline bool operator==(const ::vendor::qti::hardware::bluetooth_audio::V2_0::TimeSpec& lhs, const ::vendor::qti::hardware::bluetooth_audio::V2_0::TimeSpec& rhs);
static inline bool operator!=(const ::vendor::qti::hardware::bluetooth_audio::V2_0::TimeSpec& lhs, const ::vendor::qti::hardware::bluetooth_audio::V2_0::TimeSpec& rhs);

template<typename>
static inline std::string toString(uint8_t o);
static inline std::string toString(::vendor::qti::hardware::bluetooth_audio::V2_0::Status o);
static inline void PrintTo(::vendor::qti::hardware::bluetooth_audio::V2_0::Status o, ::std::ostream* os);
