#ifndef HIDL_GENERATED_VENDOR_QTI_HARDWARE_BLUETOOTH_AUDIO_V2_1_TYPES_H
#define HIDL_GENERATED_VENDOR_QTI_HARDWARE_BLUETOOTH_AUDIO_V2_1_TYPES_H

#include <vendor/qti/hardware/bluetooth_audio/2.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace vendor {
namespace qti {
namespace hardware {
namespace bluetooth_audio {
namespace V2_1 {

// Forward declaration for forward reference support:
enum class CodecType : uint32_t;
enum class ExtSampleRate : uint32_t;
enum class LC3ChannelMode : uint8_t;
struct lc3CodecConfig;
struct LC3Parameters;
struct CodecCapabilities;
union AudioCapabilities;
struct CodecConfiguration;
union AudioConfiguration;

enum class CodecType : uint32_t {
    UNKNOWN = 0u /* 0x00 */,
    SBC = 1u /* 0x01 */,
    AAC = 2u /* 0x02 */,
    APTX = 4u /* 0x04 */,
    APTX_HD = 8u /* 0x08 */,
    LDAC = 16u /* 0x10 */,
    BA_CELT = 17u /* 0x11 */,
    APTX_ADAPTIVE = 18u /* 0x12 */,
    APTX_TWS = 20u /* 0x14 */,
    LC3 = 24u /* 0x18 */,
};

enum class ExtSampleRate : uint32_t {
    RATE_UNKNOWN = 0u /* 0x00 */,
    RATE_44100 = 1u /* 0x01 */,
    RATE_48000 = 2u /* 0x02 */,
    RATE_88200 = 4u /* 0x04 */,
    RATE_96000 = 8u /* 0x08 */,
    RATE_176400 = 16u /* 0x10 */,
    RATE_192000 = 32u /* 0x20 */,
    RATE_16000 = 64u /* 0x40 */,
    RATE_24000 = 96u /* 0x60 */,
    RATE_32000 = 128u /* 0x80 */,
    RATE_24000_2 = 256u /* 0x100 */,
    RATE_8000 = 512u /* 0x200 */,
};

enum class LC3ChannelMode : uint8_t {
    UNKNOWN = 0 /* 0x00 */,
    STEREO = 1 /* 0x01 */,
    JOINT_STEREO = 2 /* 0x02 */,
    DUAL = 4 /* 0x04 */,
    MONO = 8 /* 0x08 */,
    CH_5_1 = 16 /* 0x10 */,
};

/**
 * Used for Hardware Encoding LC3 codec parameters
 */
struct lc3CodecConfig final {
    ::vendor::qti::hardware::bluetooth_audio::V2_1::ExtSampleRate sampleRate __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_1::LC3ChannelMode channelMode __attribute__ ((aligned(1)));
    uint16_t octetsPerFrame __attribute__ ((aligned(2)));
    uint16_t frameDuration __attribute__ ((aligned(2)));
    uint32_t bitrate __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
    uint8_t numBlocks __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::lc3CodecConfig, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::lc3CodecConfig, channelMode) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::lc3CodecConfig, octetsPerFrame) == 6, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::lc3CodecConfig, frameDuration) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::lc3CodecConfig, bitrate) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::lc3CodecConfig, bitsPerSample) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::lc3CodecConfig, numBlocks) == 17, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_1::lc3CodecConfig) == 20, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_1::lc3CodecConfig) == 4, "wrong alignment");

/**
 * Used for Hardware Encoding LC3 codec parameters
 */
struct LC3Parameters final {
    ::vendor::qti::hardware::bluetooth_audio::V2_1::lc3CodecConfig txConfig __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_1::lc3CodecConfig rxConfig __attribute__ ((aligned(4)));
    uint8_t rxConfigSet __attribute__ ((aligned(1)));
    uint16_t rxLatency __attribute__ ((aligned(2)));
    uint8_t decoderOuputChannels __attribute__ ((aligned(1)));
    uint8_t mode __attribute__ ((aligned(1)));
    ::android::hardware::hidl_array<uint8_t, 16> codecSpecific __attribute__ ((aligned(1)));
    uint8_t defaultQlevel __attribute__ ((aligned(1)));
    uint8_t NumStreamIDGroup __attribute__ ((aligned(1)));
    ::android::hardware::hidl_array<uint32_t, 48> streamMap __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters, txConfig) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters, rxConfig) == 20, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters, rxConfigSet) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters, rxLatency) == 42, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters, decoderOuputChannels) == 44, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters, mode) == 45, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters, codecSpecific) == 46, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters, defaultQlevel) == 62, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters, NumStreamIDGroup) == 63, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters, streamMap) == 64, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters) == 256, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters) == 4, "wrong alignment");

/**
 * Used to specify the capabilities of the codecs supported by Hardware Encoding.
 * AptX and AptX-HD both use the AptxParameters field.
 */
struct CodecCapabilities final {
    // Forward declaration for forward reference support:
    union Capabilities;

    union Capabilities final {
        ::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters sbcCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters aacCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::LdacParameters ldacCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxParameters aptxCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters aptxAdaptiveCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxTwsParameters aptxTwsCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters baCeltCapabilities __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters lc3Capabilities __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities::Capabilities, sbcCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities::Capabilities, aacCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities::Capabilities, ldacCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities::Capabilities, aptxCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities::Capabilities, aptxAdaptiveCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities::Capabilities, aptxTwsCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities::Capabilities, baCeltCapabilities) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities::Capabilities, lc3Capabilities) == 0, "wrong offset");
    static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities::Capabilities) == 256, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities::Capabilities) == 4, "wrong alignment");

    ::vendor::qti::hardware::bluetooth_audio::V2_1::CodecType codecType __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities::Capabilities capabilities __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities, codecType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities, capabilities) == 4, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities) == 260, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities) == 4, "wrong alignment");

/**
 * Used to specify the capabilities of the different session types.
 */
union AudioCapabilities final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::PcmParameters pcmCapabilities __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_1::CodecCapabilities codecCapabilities __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::AudioCapabilities, pcmCapabilities) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::AudioCapabilities, codecCapabilities) == 0, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_1::AudioCapabilities) == 260, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_1::AudioCapabilities) == 4, "wrong alignment");

/**
 * Used to configure a Hardware Encoding session.
 * AptX and AptX-HD both use the AptxParameters field.
 */
struct CodecConfiguration final {
    // Forward declaration for forward reference support:
    union CodecSpecific;

    union CodecSpecific final {
        ::vendor::qti::hardware::bluetooth_audio::V2_0::SbcParameters sbcConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AacParameters aacConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::LdacParameters ldacConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxParameters aptxConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxAdaptiveParameters aptxAdaptiveConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::AptxTwsParameters aptxTwsConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_0::BaCeltParameters baCeltConfig __attribute__ ((aligned(4)));
        ::vendor::qti::hardware::bluetooth_audio::V2_1::LC3Parameters lc3Config __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration::CodecSpecific, sbcConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration::CodecSpecific, aacConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration::CodecSpecific, ldacConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration::CodecSpecific, aptxConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration::CodecSpecific, aptxAdaptiveConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration::CodecSpecific, aptxTwsConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration::CodecSpecific, baCeltConfig) == 0, "wrong offset");
    static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration::CodecSpecific, lc3Config) == 0, "wrong offset");
    static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration::CodecSpecific) == 256, "wrong size");
    static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration::CodecSpecific) == 4, "wrong alignment");

    ::vendor::qti::hardware::bluetooth_audio::V2_1::CodecType codecType __attribute__ ((aligned(4)));
    /**
     * The encoded audio bitrate in bits / second.
     * 0x00000000 - The audio bitrate is not specified / unused
     * 0x00000001 - 0x00FFFFFF - Encoded audio bitrate in bits/second
     * 0x01000000 - 0xFFFFFFFF - Reserved
     *
     * The HAL needs to support all legal bitrates for the selected codec.
     */
    uint32_t encodedAudioBitrate __attribute__ ((aligned(4)));
    /**
     * Peer MTU (in octets)
     */
    uint16_t peerMtu __attribute__ ((aligned(2)));
    /**
     * Content protection by SCMS-T
     */
    bool isScmstEnabled __attribute__ ((aligned(1)));
    /**
     * Scrambling Requirement
     */
    bool isScramblingEnabled __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration::CodecSpecific config __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration, codecType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration, encodedAudioBitrate) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration, peerMtu) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration, isScmstEnabled) == 10, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration, isScramblingEnabled) == 11, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration, config) == 12, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration) == 268, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration) == 4, "wrong alignment");

/**
 * Used to configure either a Hardware or Software Encoding session based on session type
 */
union AudioConfiguration final {
    ::vendor::qti::hardware::bluetooth_audio::V2_0::PcmParameters pcmConfig __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::bluetooth_audio::V2_1::CodecConfiguration codecConfig __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::AudioConfiguration, pcmConfig) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::bluetooth_audio::V2_1::AudioConfiguration, codecConfig) == 0, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::bluetooth_audio::V2_1::AudioConfiguration) == 268, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::bluetooth_audio::V2_1::AudioConfiguration) == 4, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint32_t o);
static inline std::string toString(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecType o);
static inline void PrintTo(::vendor::qti::hardware::bluetooth_audio::V2_1::CodecType o, ::std::ostream* os);
constexpr uint32_t operator|(const ::vendor::qti::hardware::bluetooth_audio::V2_1::CodecType lhs, const ::vendor::qti::hardware::bluetooth_audio::V2_1::CodecType rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const uint32_t lhs, const ::vendor::qti::hardware::bluetooth_audio::V2_1::CodecType rhs) {
    return static_cast<uint32_t>(lhs | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const ::vendor::qti::hardware::bluetooth_audio::V2_1::CodecType lhs, const uint32_t rhs) {
