#ifndef HIDL_GENERATED_VENDOR_MEDIATEK_HARDWARE_BLUETOOTH_AUDIO_V2_2_TYPES_H
#define HIDL_GENERATED_VENDOR_MEDIATEK_HARDWARE_BLUETOOTH_AUDIO_V2_2_TYPES_H

#include <vendor/mediatek/hardware/bluetooth/audio/2.1/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace vendor {
namespace mediatek {
namespace hardware {
namespace bluetooth {
namespace audio {
namespace V2_2 {

// Forward declaration for forward reference support:
enum class SessionType : uint8_t;
enum class SampleRate : uint32_t;
enum class CodecType : uint32_t;
struct PcmParameters;
enum class Lc3FrameDuration : uint8_t;
struct Lc3Parameters;
enum class PlcMethod : uint8_t;
struct LeAudioCodecConfiguration;
struct ConnParam;
struct AudioConfiguration;
struct LeAudioCodecCapabilities;
struct AudioCapabilities;

enum class SessionType : uint8_t {
    UNKNOWN = 0,
    /**
     * A2DP legacy that AVDTP media is encoded by Bluetooth Stack
     */
    A2DP_SOFTWARE_ENCODING_DATAPATH = 1 /* ::vendor::mediatek::hardware::bluetooth::audio::V2_1::SessionType.UNKNOWN implicitly + 1 */,
    /**
     * The encoding of AVDTP media is done by HW and there is control only
     */
    A2DP_HARDWARE_OFFLOAD_DATAPATH = 2 /* ::vendor::mediatek::hardware::bluetooth::audio::V2_1::SessionType.A2DP_SOFTWARE_ENCODING_DATAPATH implicitly + 1 */,
    /**
     * Used when encoded by Bluetooth Stack and streaming to Hearing Aid
     */
    HEARING_AID_SOFTWARE_ENCODING_DATAPATH = 3 /* ::vendor::mediatek::hardware::bluetooth::audio::V2_1::SessionType.A2DP_HARDWARE_OFFLOAD_DATAPATH implicitly + 1 */,
    /**
     * Used when encoded by Bluetooth Stack and streaming to LE Audio device
     */
    LE_AUDIO_SOFTWARE_ENCODING_DATAPATH = 4 /* ::vendor::mediatek::hardware::bluetooth::audio::V2_1::SessionType.HEARING_AID_SOFTWARE_ENCODING_DATAPATH implicitly + 1 */,
    /**
     * Used when decoded by Bluetooth Stack and streaming to audio framework
     */
    LE_AUDIO_SOFTWARE_DECODED_DATAPATH = 5 /* ::vendor::mediatek::hardware::bluetooth::audio::V2_2::SessionType.LE_AUDIO_SOFTWARE_ENCODING_DATAPATH implicitly + 1 */,
    /**
     * Encoding is done by HW an there is control only
     */
    LE_AUDIO_HARDWARE_OFFLOAD_ENCODING_DATAPATH = 6 /* ::vendor::mediatek::hardware::bluetooth::audio::V2_2::SessionType.LE_AUDIO_SOFTWARE_DECODED_DATAPATH implicitly + 1 */,
    /**
     * Decoding is done by HW an there is control only
     */
    LE_AUDIO_HARDWARE_OFFLOAD_DECODING_DATAPATH = 7 /* ::vendor::mediatek::hardware::bluetooth::audio::V2_2::SessionType.LE_AUDIO_HARDWARE_OFFLOAD_ENCODING_DATAPATH implicitly + 1 */,
};

enum class SampleRate : uint32_t {
    RATE_UNKNOWN = 0u /* 0x00 */,
    RATE_44100 = 1u /* 0x01 */,
    RATE_48000 = 2u /* 0x02 */,
    RATE_88200 = 4u /* 0x04 */,
    RATE_96000 = 8u /* 0x08 */,
    RATE_176400 = 16u /* 0x10 */,
    RATE_192000 = 32u /* 0x20 */,
    RATE_16000 = 64u /* 0x40 */,
    RATE_24000 = 128u /* 0x80 */,
    RATE_8000 = 256u /* 0x100 */,
    RATE_32000 = 512u /* 0x200 */,
};

enum class CodecType : uint32_t {
    UNKNOWN = 0u /* 0x00 */,
    SBC = 1u /* 0x01 */,
    AAC = 2u /* 0x02 */,
    APTX = 4u /* 0x04 */,
    APTX_HD = 8u /* 0x08 */,
    LDAC = 16u /* 0x10 */,
    LHDC = 32u /* 0x20 */,
    LC3 = 64u /* 0x40 */,
};

/**
 * Used for Software Encoding audio feed parameters
 */
struct PcmParameters final {
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::SampleRate sampleRate __attribute__ ((aligned(4)));
    ::vendor::mediatek::hardware::bluetooth::audio::V2_1::ChannelMode channelMode __attribute__ ((aligned(1)));
    ::vendor::mediatek::hardware::bluetooth::audio::V2_1::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
    ::vendor::mediatek::hardware::bluetooth::audio::V2_1::LhdcLowLatencyEn isLowLatencyEnabled __attribute__ ((aligned(1)));
    /**
     * Data interval for data transfer
     */
    uint32_t dataIntervalUs __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters, sampleRate) == 0, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters, channelMode) == 4, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters, bitsPerSample) == 5, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters, isLowLatencyEnabled) == 6, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters, dataIntervalUs) == 8, "wrong offset");
static_assert(sizeof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters) == 12, "wrong size");
static_assert(__alignof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters) == 4, "wrong alignment");

enum class Lc3FrameDuration : uint8_t {
    DURATION_10000US = 0 /* 0x00 */,
    DURATION_7500US = 1 /* 0x01 */,
};

/**
 * Used for Hardware Encoding/Decoding LC3 codec parameters.
 */
struct Lc3Parameters final {
    /*
     * PCM is Input for encoder, Output for decoder
     */
    ::vendor::mediatek::hardware::bluetooth::audio::V2_1::BitsPerSample pcmBitDepth __attribute__ ((aligned(1)));
    /*
     * codec-specific parameters
     */
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::SampleRate samplingFrequency __attribute__ ((aligned(4)));
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::Lc3FrameDuration frameDuration __attribute__ ((aligned(1)));
    /*
     * length in octets of a codec frame
     */
    uint32_t octetsPerFrame __attribute__ ((aligned(4)));
    /*
     * Number of blocks of codec frames per single SDU (Service Data Unit)
     */
    uint8_t blocksPerSdu __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::Lc3Parameters, pcmBitDepth) == 0, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::Lc3Parameters, samplingFrequency) == 4, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::Lc3Parameters, frameDuration) == 8, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::Lc3Parameters, octetsPerFrame) == 12, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::Lc3Parameters, blocksPerSdu) == 16, "wrong offset");
static_assert(sizeof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::Lc3Parameters) == 20, "wrong size");
static_assert(__alignof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::Lc3Parameters) == 4, "wrong alignment");

enum class PlcMethod : uint8_t {
    STANDARD_PLC = 0 /* 0x00 */,
    ENHANCED_PLC = 1 /* 0x01 */,
};

/**
 * Used to configure a LC3 Hardware Encoding session.
 */
struct LeAudioCodecConfiguration final {
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::CodecType codecType __attribute__ ((aligned(4)));
    /*
     * This is also bitfield, specifying how the channels are ordered in the outgoing media packet.
     * Bit meaning is defined in Bluetooth Assigned Numbers.
     */
    uint32_t audioChannelAllocation __attribute__ ((aligned(4)));
    uint32_t encodedAudioBitrate __attribute__ ((aligned(4)));
    bool bfi_ext __attribute__ ((aligned(1)));
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::PlcMethod plc_method __attribute__ ((aligned(1)));
    uint8_t le_audio_type __attribute__ ((aligned(1)));
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::Lc3Parameters lc3Config __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration, codecType) == 0, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration, audioChannelAllocation) == 4, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration, encodedAudioBitrate) == 8, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration, bfi_ext) == 12, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration, plc_method) == 13, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration, le_audio_type) == 14, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration, lc3Config) == 16, "wrong offset");
static_assert(sizeof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration) == 36, "wrong size");
static_assert(__alignof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration) == 4, "wrong alignment");

struct ConnParam final {
    uint32_t conn_handle_R __attribute__ ((aligned(4)));
    uint32_t conn_handle_L __attribute__ ((aligned(4)));
    uint8_t bn __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::ConnParam, conn_handle_R) == 0, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::ConnParam, conn_handle_L) == 4, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::ConnParam, bn) == 8, "wrong offset");
static_assert(sizeof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::ConnParam) == 12, "wrong size");
static_assert(__alignof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::ConnParam) == 4, "wrong alignment");

/**
 * Used to configure either a Hardware or Software Encoding session based on session type
 */
struct AudioConfiguration final {
    enum class hidl_discriminator : uint8_t {
        pcmConfig = 0,  // ::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters
        codecConfig = 1,  // ::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecConfiguration
        leAudioCodecConfig = 2,  // ::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration
    };

    AudioConfiguration();
    ~AudioConfiguration();
    AudioConfiguration(AudioConfiguration&&);
    AudioConfiguration(const AudioConfiguration&);
    AudioConfiguration& operator=(AudioConfiguration&&);
    AudioConfiguration& operator=(const AudioConfiguration&);

    void pcmConfig(const ::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters&);
    void pcmConfig(::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters&&);
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters& pcmConfig();
    const ::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters& pcmConfig() const;

    void codecConfig(const ::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecConfiguration&);
    void codecConfig(::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecConfiguration&&);
    ::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecConfiguration& codecConfig();
    const ::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecConfiguration& codecConfig() const;

    void leAudioCodecConfig(const ::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration&);
    void leAudioCodecConfig(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration&&);
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration& leAudioCodecConfig();
    const ::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration& leAudioCodecConfig() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioConfiguration, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters pcmConfig __attribute__ ((aligned(4)));
        ::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecConfiguration codecConfig __attribute__ ((aligned(4)));
        ::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecConfiguration leAudioCodecConfig __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioConfiguration::hidl_union) == 36, "wrong size");
    static_assert(__alignof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioConfiguration::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioConfiguration::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioConfiguration::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioConfiguration) == 40, "wrong size");
static_assert(__alignof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioConfiguration) == 4, "wrong alignment");

/**
 * Used to specify the capabilities of the LC3 codecs supported by Hardware Encoding.
 */
struct LeAudioCodecCapabilities final {
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::CodecType codecType __attribute__ ((aligned(4)));
    /*
     * This is bitfield, if bit N is set, HW Offloader supports N+1 channels at the same time.
     * Example: 0x27 = 0b00100111: One, two, three or six channels supported.
     */
    uint8_t supportedChannelCounts __attribute__ ((aligned(1)));
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::Lc3Parameters lc3Capabilities __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecCapabilities, codecType) == 0, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecCapabilities, supportedChannelCounts) == 4, "wrong offset");
static_assert(offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecCapabilities, lc3Capabilities) == 8, "wrong offset");
static_assert(sizeof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecCapabilities) == 28, "wrong size");
static_assert(__alignof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecCapabilities) == 4, "wrong alignment");

/**
 * Used to specify the capabilities of the different session types
 */
struct AudioCapabilities final {
    enum class hidl_discriminator : uint8_t {
        pcmCapabilities = 0,  // ::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters
        codecCapabilities = 1,  // ::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecCapabilities
        leAudioCapabilities = 2,  // ::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecCapabilities
    };

    AudioCapabilities();
    ~AudioCapabilities();
    AudioCapabilities(AudioCapabilities&&);
    AudioCapabilities(const AudioCapabilities&);
    AudioCapabilities& operator=(AudioCapabilities&&);
    AudioCapabilities& operator=(const AudioCapabilities&);

    void pcmCapabilities(const ::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters&);
    void pcmCapabilities(::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters&&);
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters& pcmCapabilities();
    const ::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters& pcmCapabilities() const;

    void codecCapabilities(const ::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecCapabilities&);
    void codecCapabilities(::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecCapabilities&&);
    ::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecCapabilities& codecCapabilities();
    const ::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecCapabilities& codecCapabilities() const;

    void leAudioCapabilities(const ::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecCapabilities&);
    void leAudioCapabilities(::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecCapabilities&&);
    ::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecCapabilities& leAudioCapabilities();
    const ::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecCapabilities& leAudioCapabilities() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioCapabilities, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::vendor::mediatek::hardware::bluetooth::audio::V2_2::PcmParameters pcmCapabilities __attribute__ ((aligned(4)));
        ::vendor::mediatek::hardware::bluetooth::audio::V2_1::CodecCapabilities codecCapabilities __attribute__ ((aligned(4)));
        ::vendor::mediatek::hardware::bluetooth::audio::V2_2::LeAudioCodecCapabilities leAudioCapabilities __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioCapabilities::hidl_union) == 28, "wrong size");
    static_assert(__alignof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioCapabilities::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioCapabilities::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioCapabilities::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioCapabilities) == 32, "wrong size");
static_assert(__alignof(::vendor::mediatek::hardware::bluetooth::audio::V2_2::AudioCapabilities) == 4, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint8_t o);
static inline std::string toString(::vendor::mediatek::hardware::bluetooth::audio::V2_2::SessionType o);
static inline void PrintTo(::vendor::mediatek::hardware::bluetooth::audio::V2_2::SessionType o, ::std::ostream* os);
constexpr uint8_t operator|(const ::vendor::mediatek::hardware::bluetooth::audio::V2_2::SessionType lhs, const ::vendor::mediatek::hardware::bluetooth::audio::V2_2::SessionType rhs) {
    return static_cast<uint8_t>(static_cast<uint8_t>(lhs) | static_cast<uint8_t>(rhs));
}
constexpr uint8_t operator|(const uint8_t lhs, const ::vendor::mediatek::hardware::bluetooth::audio::V2_2::SessionType rhs) {
    return static_cast<uint8_t>(lhs | static_cast<uint8_t>(rhs));
}
